# Использование официального, оптимизированного для продакшена образа Python
FROM python:3.14-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Создаем директорию для статических файлов и шаблонов, необходимых для FastAPI
RUN mkdir templates

# Копируем файл зависимостей
COPY requirements.txt .

# Устанавливаем зависимости Python. 
# Флаг --no-cache-dir помогает уменьшить размер образа.
RUN pip install --no-cache-dir -r requirements.txt

# Копируем ваш файл приложения и шаблон
COPY . .

# Приложение прослушивает порт 8000, как указано в коде
EXPOSE 8000

# Команда для запуска приложения с Uvicorn. 
# Используем явную команду для продакшен-запуска.
# 'app:app' означает: модуль 'app' и объект 'app' внутри него.
CMD ["uvicorn", "app:app", "--host", "0.0.0.0", "--port", "8000"]
